; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared4 - mode
	infrared0 - mode
	infrared3 - mode
	infrared2 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared4)
	(supports instrument2 infrared1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(have_image Phenomenon7 infrared3)
	(have_image Planet8 infrared2)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon12 infrared1)
	(have_image Star13 infrared0)
	(have_image Planet14 infrared4)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite0 star13 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star13)
   goals met: 0 of 8
4. (take_image satellite0 star13 instrument1 infrared0)
   added: (have_image star13 infrared0)
   goals met: 1 of 8
5. (turn_to satellite0 planet14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet14)
   goals met: 1 of 8
6. (take_image satellite0 planet14 instrument1 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 2 of 8
7. (turn_to satellite0 star4 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star4)
   goals met: 2 of 8
8. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 3 of 8
13. (turn_to satellite0 planet8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet8)
   goals met: 3 of 8
14. (take_image satellite0 planet8 instrument0 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 4 of 8
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 8
16. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 8
17. (turn_to satellite0 groundstation0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 8
18. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 8
19. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 8
20. (take_image satellite0 phenomenon10 instrument2 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 5 of 8
21. (turn_to satellite0 phenomenon12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 8
22. (take_image satellite0 phenomenon12 instrument2 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 6 of 8
23. (turn_to satellite0 phenomenon7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 8
24. (take_image satellite0 phenomenon7 instrument2 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 7 of 8
25. (turn_to satellite0 planet9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet9)
   goals met: 7 of 8
26. (take_image satellite0 planet9 instrument2 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 8 of 8
